// определение, прототипирование и вызов функции
#include<iostream>
using namespace std;
void simple();                  // прототип
//=================================================================================
int main(void)
{
    cout << "Начало работы main() до вызова функции" << endl;
    // вызов функции
    simple();                     
    cout << "Окончание работы программы после завершения работы функции" << endl;
}
//---------------------------------------------------------------------------------
void simple() 
{     
    cout << "Начало работы функции" << endl;
    int size;
    cout    <<  "Размер: ";
    cin     >>  size;
    size++;
    cout << endl;
    double array[size][size];
    for (int i = 0; i < size; i++)
    {
        for (int j = 0; j < size; j++)
        {
            if ((i * j) != 0)
            {
                array[i][j] = i * j;
                cout << array[i][j] << "\t";
            }
        }
        cout << endl << endl;
    }
}
//---------------------------------------------------------------------------------