/*******************************************************************************
 * fun_ptr.cpp -- программа демонстрирующая использование указателей на функцию
 * estimate() - функция, которая оценивает затраты времени, необходимого для
 * написания кода. В качестве аргумента, она принимает указатель на функцию,
 * представляющую собой алгаритм оценки сложности кода.
 ******************************************************************************/
#include<iostream>
double betsy(int);
double pam(int);
double alx(int lns);
// Второй аргумент - указатель на функцию double,
// которая принимает аргумент типа int
void estimate(int lines, double (*pf)(int));
//=============================================================================
int main()
{
    using namespace std;
    int code;
    cout << "Введите количество строк кода: ";
    cin >> code;
    cout << "Оценка Betsy алгоритмом:" << endl;
    estimate(code, betsy);
    cout << "Оценка Pam алгоритмом:" << endl;
    estimate(code, pam);
    cout << "Оценка Alx алгоритмом:" << endl;
    estimate(code, alx);
    return 0;
}
//------------------------------------------------------------------------------
// принимает указатель на функцию, и вызывает эту функцию
void estimate(int lines, double (*pf)(int))
{
    using namespace std;
    cout    << lines << " строк потребуют "
            << (*pf)(lines) << " часов работы." << endl;
}
//------------------------------------------------------------------------------
// алгоритм betsy
double betsy(int lns)
{
    return 0.05 * lns;
}
//------------------------------------------------------------------------------
// алгоритм pam
double pam(int lns)
{
    return 0.03 * lns + 0.0004 * lns * lns;
}
//-------------------------------------------------------------------------------
// алгоритм alx
double alx(int lns)
{
    const double figur = 0.05;
    const double rest = 0.005;
    double total = lns * lns * rest * figur;
    return total;
}
