/***************************************************************************************
 * Функция заменяющая каждую найденный символ c1 в строке на символ c2
 **************************************************************************************/

#include<iostream>
using namespace std;
int replace(char str[], char c1, char c2);
//========================================================================
int main()
{
    char *str = "ululate";
    char c1 = 'u';
    char c2 = '*';
    cout    << "Строка до замены: " << str << endl
            << "Найдено символов \'" << c1 << "\' :"  
            << replace(str, c1, c2) << endl
            << "Строка после замены: " << str << endl;
    return 0;
}
//--------------------------------------------------------------------------------------
int replace(char str[], char c1, char c2)
{
    int count = 0;
    while (*str)
    {
        if (*str == c1)
        {
            *str = c2;
            count++;
        }
        str++;
    }
    return count;
}
