/***********************************************************************************************************
 * Напишите программу, которая запрашивает у пользователя 10 результатов игры в гольф, сохраняя из в массива.
 * При этом необходимо обеспечить возможность прекращения ввода до ввода всех 10 результатов.
 * Программа должна отобразить все результаты в одной строке и сообщить их среднее значение.
 * три функции: 1. Ввод значений, 2. Вычисление среднего, 3. Отображение результата.
 **********************************************************************************************************/
#include<iostream>
using namespace std;
const int Max = 10;
int EnteringValues(double golf[], int);
double AverageVal(double golf[], int);
void DisplayVal(double golf[], int, double);
//=========================================================================================================
int main(void)
{
    double *golf = new double[Max];
    int intro = EnteringValues(golf, Max);                      // кол-во реально введенных значений
    double Average = AverageVal(golf, intro);                   // среднее значение
    DisplayVal(golf, intro, Average);                           // вывод
    cout    << "Введено результатов: " << intro << endl
            << "Программа завершена !!!";
    delete[] golf;
}
//---------------------------------------------------------------------------------------------------------
// функция для ввода значений
int EnteringValues(double golf[], int x)
{                 
    int i = 0;
    cout << "Вводите результаты матча по гольфу. Не числовое значение прервет ввод." << endl;
    while (i < x)
    {
        cout << "Результат № " << i + 1 << ": ";
        if (cin >> golf[i])                                 // неправильный ввод
        {
            i++;
        }
        else break;
    }
    return i;
}
//----------------------------------------------------------------------------------------------------------
// функция для вычисления среднего значения
double AverageVal(double golf[], int intro)
{                
    double Total = 0;
    for (int i = 0; i < intro; i++)
    {
        Total += golf[i];
    }
    return Total / intro;
}
//----------------------------------------------------------------------------------------------------------
// функция для вывода результатов
void DisplayVal(double golf[], int intro, double Average)
{  
    cout << "Введенные результаты:" << endl;
    for (int i = 0; i < intro; i++)
    {
        cout << golf[i] << "\t";
    }
    cout << endl << "Среднее значение: " << Average << endl;
}   
